import numpy as np
import matplotlib.pyplot as plt

# Обновленные данные для каждой риски
data = {
    '1 риска': {
        'ε': [2.15865793, 3.87132157, 5.75279421, 7.85534935],
        'M': [0.06097521, 0.12141521, 0.18124088, 0.24034041]
    },
    '2 риска': {
        'ε': [1.68398543, 3.2256, 4.15018396, 5.34554607],
        'M': [0.061049, 0.121617, 0.181992, 0.241909]
    },
    '3 риска': {
        'ε': [1.206337, 2.172855, 3.033365, 4.053973],
        'M': [0.061124, 0.121946, 0.182516, 0.242716]
    },
    '4 риска': {
        'ε': [0.87136553, 1.57298461, 2.32287074, 3.15953984],
        'M': [0.06117635, 0.12213344, 0.18284865, 0.24327529]
    },
    '5 риска': {
        'ε': [0.66402943, 1.26378852, 1.85798985, 2.34191058],
        'M': [0.061209, 0.12223, 0.183067, 0.243786]
    },
    '6 риска': {
        'ε': [0.522093, 0.993788, 1.452128, 1.92519],
        'M': [0.061231, 0.122314, 0.183257, 0.244047]
    }
}

# Создаем график
plt.figure(figsize=(10, 6))

# Для каждой риски строим график
for riska, values in data.items():
    plt.plot(values['ε'], values['M'], label=riska, marker='o')

# Настроим график
plt.title('Зависимость момента силы M от углового ускорения ε')
plt.xlabel('Угловое ускорение (ε) [рад/с]')
plt.ylabel('Момент силы (M) [Н·м]')
plt.grid(True)
plt.legend(title="Положение утяжелителей")

# Показать график
plt.tight_layout()
plt.show()